; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	image1 - mode
	spectrograph0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Planet3 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 150)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 193)
	(= (data Planet3 infrared2) 139)
	(= (data Star4 infrared2) 117)
	(= (data Planet5 infrared2) 153)
	(= (data Planet6 infrared2) 277)
	(= (data Star7 infrared2) 100)
	(= (data Planet3 image1) 125)
	(= (data Star4 image1) 236)
	(= (data Planet5 image1) 209)
	(= (data Planet6 image1) 280)
	(= (data Star7 image1) 219)
	(= (data Planet3 spectrograph0) 11)
	(= (data Star4 spectrograph0) 139)
	(= (data Planet5 spectrograph0) 79)
	(= (data Planet6 spectrograph0) 17)
	(= (data Star7 spectrograph0) 255)
	(= (slew_time Star1 Star0) 53.47)
	(= (slew_time Star0 Star1) 53.47)
	(= (slew_time Star2 Star0) 13.72)
	(= (slew_time Star0 Star2) 13.72)
	(= (slew_time Star2 Star1) 36.71)
	(= (slew_time Star1 Star2) 36.71)
	(= (slew_time Planet3 Star0) 76.56)
	(= (slew_time Star0 Planet3) 76.56)
	(= (slew_time Planet3 Star1) 12.1)
	(= (slew_time Star1 Planet3) 12.1)
	(= (slew_time Planet3 Star2) 11.27)
	(= (slew_time Star2 Planet3) 11.27)
	(= (slew_time Star4 Star0) 5.576)
	(= (slew_time Star0 Star4) 5.576)
	(= (slew_time Star4 Star1) 10.65)
	(= (slew_time Star1 Star4) 10.65)
	(= (slew_time Star4 Star2) 57.31)
	(= (slew_time Star2 Star4) 57.31)
	(= (slew_time Star4 Planet3) 64.73)
	(= (slew_time Planet3 Star4) 64.73)
	(= (slew_time Planet5 Star0) 31.01)
	(= (slew_time Star0 Planet5) 31.01)
	(= (slew_time Planet5 Star1) 38.33)
	(= (slew_time Star1 Planet5) 38.33)
	(= (slew_time Planet5 Star2) 32.32)
	(= (slew_time Star2 Planet5) 32.32)
	(= (slew_time Planet5 Planet3) 77.58)
	(= (slew_time Planet3 Planet5) 77.58)
	(= (slew_time Planet5 Star4) 27.42)
	(= (slew_time Star4 Planet5) 27.42)
	(= (slew_time Planet6 Star0) 43.25)
	(= (slew_time Star0 Planet6) 43.25)
	(= (slew_time Planet6 Star1) 24.33)
	(= (slew_time Star1 Planet6) 24.33)
	(= (slew_time Planet6 Star2) 7.774)
	(= (slew_time Star2 Planet6) 7.774)
	(= (slew_time Planet6 Planet3) 21.12)
	(= (slew_time Planet3 Planet6) 21.12)
	(= (slew_time Planet6 Star4) 47.58)
	(= (slew_time Star4 Planet6) 47.58)
	(= (slew_time Planet6 Planet5) 1.451)
	(= (slew_time Planet5 Planet6) 1.451)
	(= (slew_time Star7 Star0) 13.65)
	(= (slew_time Star0 Star7) 13.65)
	(= (slew_time Star7 Star1) 2.209)
	(= (slew_time Star1 Star7) 2.209)
	(= (slew_time Star7 Star2) 34.16)
	(= (slew_time Star2 Star7) 34.16)
	(= (slew_time Star7 Planet3) 20.08)
	(= (slew_time Planet3 Star7) 20.08)
	(= (slew_time Star7 Star4) 45.26)
	(= (slew_time Star4 Star7) 45.26)
	(= (slew_time Star7 Planet5) 27.35)
	(= (slew_time Planet5 Star7) 27.35)
	(= (slew_time Star7 Planet6) 66.55)
	(= (slew_time Planet6 Star7) 66.55)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet3 image1)
	(have_image Star4 image1)
	(have_image Planet5 image1)
	(have_image Planet6 infrared2)
	(have_image Star7 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 193 to 187.424, (fuel-used) from 0 to 5.576
   goals met: 0 of 5
2. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 150 to 142.226, (fuel-used) from 5.576 to 13.35
   goals met: 0 of 5
3. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 142.226 to 134.452, (fuel-used) from 13.35 to 21.124
   goals met: 0 of 5
4. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 134.452 to 126.678, (fuel-used) from 21.124 to 28.898
   goals met: 0 of 5
5. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 126.678 to 118.904, (fuel-used) from 28.898 to 36.672
   goals met: 0 of 5
6. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 118.904 to 111.13, (fuel-used) from 36.672 to 44.446
   goals met: 0 of 5
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
8. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 111.13 to 103.356, (fuel-used) from 44.446 to 52.22
   goals met: 0 of 5
9. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 103.356 to 95.582, (fuel-used) from 52.22 to 59.994
   goals met: 0 of 5
10. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 95.582 to 87.808, (fuel-used) from 59.994 to 67.768
   goals met: 0 of 5
11. (turn_to satellite1 star7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 187.424 to 142.164, (fuel-used) from 67.768 to 113.028
   goals met: 0 of 5
12. (turn_to satellite0 star0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 87.808 to 74.088, (fuel-used) from 113.028 to 126.748
   goals met: 0 of 5
13. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 5
14. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 74.088 to 43.078, (fuel-used) from 126.748 to 157.758
   goals met: 0 of 5
15. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   changed: (data_capacity satellite0) from 1000 to 791, (data-stored) from 0 to 209
   goals met: 1 of 5
16. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 43.078 to 41.627, (fuel-used) from 157.758 to 159.209
   goals met: 1 of 5
17. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 5
18. (turn_to satellite1 star1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 142.164 to 139.955, (fuel-used) from 159.209 to 161.418
   goals met: 1 of 5
19. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 1 of 5
20. (turn_to satellite1 planet3 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet3)
   changed: (fuel satellite1) from 139.955 to 127.855, (fuel-used) from 161.418 to 173.518
   goals met: 1 of 5
21. (take_image satellite1 planet3 instrument2 image1)
   added: (have_image planet3 image1)
   changed: (data_capacity satellite1) from 1000 to 875, (data-stored) from 209 to 334
   goals met: 2 of 5
22. (turn_to satellite1 star4 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 127.855 to 63.125, (fuel-used) from 173.518 to 238.248
   goals met: 2 of 5
23. (take_image satellite1 star4 instrument2 image1)
   added: (have_image star4 image1)
   changed: (data_capacity satellite1) from 875 to 639, (data-stored) from 334 to 570
   goals met: 3 of 5
24. (turn_to satellite1 star7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 63.125 to 17.865, (fuel-used) from 238.248 to 283.508
   goals met: 3 of 5
25. (take_image satellite0 planet6 instrument0 infrared2)
   added: (have_image planet6 infrared2)
   changed: (data_capacity satellite0) from 791 to 514, (data-stored) from 570 to 847
   goals met: 4 of 5
26. (take_image satellite1 star7 instrument2 image1)
   added: (have_image star7 image1)
   changed: (data_capacity satellite1) from 639 to 420, (data-stored) from 847 to 1066
   goals met: 5 of 5
